{
  "data": {
    "name": "Gitmel Gutiérrez",
    "profession": "Web3 Product Developer",
    "address": "San Joaquin, Venezuela",
    "email": "gitmelbco@gmail.com",
    "phone": "+584122923204",
    "objetive": "I want to build and collaborate in the creation of solutions that connect blockchain with more people.",
    "projects": {
      "CryptoShepherd":
      {
        "id": "CryptoShepherd",
        "title": "thecryptoshepherd.xyz",
        "timeframe": "Oct 2022 - Currently",
        "description": "The CryptoShepherd is a platform specifically designed to streamline and consolidate asset management in the Web3 environment. This user-friendly tool enables users to obtain a comprehensive overview of their cryptocurrency portfolio, facilitating seamless transfers between different wallets.",
        "problem": "Initiating the use of a cold wallet can be a daunting task. The first hurdle involves activating the wallet by creating a seed phrase, which may be perplexing and overwhelming, especially for individuals who are unfamiliar with cold wallet technology. Furthermore, users are required to transfer all of their cryptocurrency assets to secure addresses, a process that is time-consuming and carries the potential risk of errors or mishaps if not executed carefully.",
        "goal": "Build a multi-wallet and multi-network platform where users can have a centralized view of all their assets and perform operations between their own accounts.",
        "rolDescription": "Fronted Dev, UI design, UX research",
        "toolsDescription": "Forms.app, Figma, React, Chakra UI, web3",
        "owner": "The Crypto Shepherd",
        "photo": "/CSCover.png",
        "bgColor":"#7288E0",
        "open": true,
        "stages": [
          {
            "stage": "EMPATHIZE",
            "nombreDelPaso": "Understanding User Motivations and Pain Points",
            "description": "To validate why and how users are actually using crypto wallets, we conducted user research thought a survey, which provided the following insights:",
            "ul": {
              "1": "Although all users use CEX (Centralized Exchanges) to purchase cryptocurrencies, only 14% choose to keep their cryptocurrencies on these platforms.",
              "2": "Furthermore, it was identified that a portion of users (50%) who currently do not use cold wallets plan to do so soon due to a lack of trust in CEX.",
              "3": "Another 25% of users do not use cold wallets because they do not know how to use them, while another 25% consider them too complicated"
            },
            "photoH": "/shepherdStatics.jpg",
            "photoV": "/paintPoints.jpg"
          },
          {
            "stage": "DEFINE",
            "nombreDelPaso": "Defining a User-Centered Approach",
            "description": " For the MVP purpose, we have chosen to focus on features related to asset visualization, connecting with a Metamask account, and transferring assets to a secure address. As a result, the user journey has been defined as follows:",
            "ul": {
            },
            "photoH": "/SheperdWireflow.png",
            "photoV": "/scopeCanvas.jpg"

          },
          {
            "stage": "PROTOTYPE",
            "nombreDelPaso": "Bringing the MVP to Life",
            "description": "The Prototyping Stage marks an exciting phase in the design process of the The Crypto Shepherd platform. With a clear understanding of user needs and preferences, as well as defined features and functionalities, we are now ready to bring our ideas to life through prototyping.",
            "descriptionTwo": "Through the prototyping process, we will refine our designs, validate our assumptions, and ensure that The Crypto Shepherd delivers an exceptional user experience. So, let's dive into the prototyping stage and bring the vision of The Crypto Shepherd to life!",
            "ul": {
          },
            "descriptionThree": "To sort this, i used a prioritization matrix, our axes was based on how many people used this vs. how much it's used",
            "photoH": "/SHPEHERDPROTOTYPE.jpg",
            "photoV": "/matrix.jpg"
          },
          {
            "nombreDelPaso": "Key Learnings",
            "description": "With the features defined and already prioritized, the interface design process was simplified. I focused on providing the most natural experience by focusing on 4 big blocks:",
            "ul": {
              "2": "Branding and Identity: Developing a strong and distinct branding for the CryptoShepherd was another valuable learning. Creating a memorable brand identity, including the logo, color scheme, and overall visual language, helped to establish a cohesive and recognizable image for the platform.",
              "3": "Landing Page Design and Development: The creation of a well-designed and informative landing page was a significant achievement for the CryptoShepherd project. The landing page served as the first point of contact for potential users, providing them with an overview of the platform's features, benefits, and value proposition. ",
              "4": "Hero Animation Tutorial: A notable contribution to the CryptoShepherd project was the creation of a tutorial explaining the hero animation. This tutorial served as a valuable resource for users and developers, guiding them through the implementation of this engaging animation on the platform.",
              "5": "Creating Demo: One of the most enjoyable and fulfilling experiences during the CryptoShepherd project was the opportunity to create a demo video. I took on the responsibility of designing and producing the video, which allowed me to experiment with different creative elements such as music, transitions, and engaging explanations."

          },
          "videoV": "/shepherdVideo.mp4",
          "descriptionThree": "These experiences have provided valuable insights into branding, UI design, UX research, and the importance of effective communication through tutorials and demos. The CryptoShepherd project has been a great opportunity for personal growth and has deepened my passion for creating innovative and user-centered digital solutions."
          }
        ]
      },
      "cryptoBaddies":
      {
        "id": "cryptoBaddies",
        "title": "Crypto Baddies",
        "shortDescription": "Crypto Baddies, it's a web3 community to empower woman and no-binary through mentorship sessions, talks  and project launchpad.",
        "description": "Crypto Baddies, it's a web3 community to empower woman and no-binary through mentorship sessions, talks  and project launchpad. The process of become a Crypto Baddie and getting access to the conferences, supposes the mint of an NFT.",
        "problem": "Everybody is talking about how to build on the web3 ecosystem and also, everybody wants that more people get involve with this space and uses it. But fot non-technical people isn't easy always.",
        "goal": "Bring the opportunity to learn about the web3 minting its NFT access,guiding our users through each step.",
        "rolDescription": "UX designer, UI Design, Fronted Developer",
        "toolsDescription": "Miro, Figma, SCSS, NextJS, ether.js",
        "timeframe": "Aug-Sept 2022",
        "owner": "Ceercle Project",
        "photo": "CBCover.png",
        "bgColor":"#91F0D2",
        "open": true,
        "stages": [
          {
            "stage": "EMPATHIZE",
            "nombreDelPaso": "All starts with a little empathy",
            "description": "I began the process identifying which will be our users and its capabilities, pains, interests and goals. Our users are beginners and this may be considered it's first approach to web3, in this order of ideas, i wanted to build it's minting process as accompanied as possible and avoid all the frustrating that perhaps could happen when we don't understand what we're doing wrong.",
            "descriptionTwo": "Just to synthesize the previous research about our users, i created a user persona. This persona served as a continuous reminder of the characteristics of the kind of people who may use Crypto Baddies.",
            "ul": {
            },
          "descriptionThree": "",
          "photoV": "/PersonaCB2.jpg",
          "photoH": "/PersonaCB2.jpg"
          },
          {
            "stage": "DEFINE",
            "nombreDelPaso": "The journey to Mint your first NFT",
            "description": "Using the research findings and user persona, I was then able to chart a wireflow. The flow below shows all the possible errors that might found a beginner. I founded that to accomplish our objective the users will need to pass across three (03) stages:",
            "descriptionTwo": "",
            "ul": {
              "1": "Metamask",
              "2": "Create | connect the wallet",
              "3": "Minting process"
          },
            "descriptionThree": "",
            "photoH": "/prueba3.jpg",
            "photoV": "/wireflowVCB.jpg"},
          {
            "stage": "IDEATE",
            "nombreDelPaso": "Metamask",
            "description": "Metamask is one of the most popular wallet on web3, but that doesn't mean that everybody knows about it. When someone is launching metamask might found three (03) typical issues",
            "ul": {
              "1": "Browser incompatibility",
              "2": "Extension not installed",
              "3": "Not logged account (even not created account)"
          },
          "descriptionThree": "To improve our users experience, i designed all this possible errors focused on two things: what means the error and how can our user overcome this. About the first, i choose to use a simple language, nothing that sounds like 404 error. About the last thing i decanted to link to the official documentation, i think that's good enough and truly trusted.",
            "photoH": "/metamaskError.gif",
            "photoV": "/metamaskError.gif"

          },
          {
            "stage": "PROTOTYPE",
            "nombreDelPaso": "Create | connect the wallet",
            "description": "",
            "descriptionTwo": "Our users has already created an account, but they could face another possibles issues",
            "ul": {
              "1": "Incorrect network",
              "2": "Not funds"
          },
          "descriptionThree": "That's why in the frontend i request the information about the wallet that is connected, it's network and also get the balance. With this information can prevent the user like'Hey friend, you don't have any funds or is insufficient, please fund the wallet!', at the same time this avoid the unnecessary execution of the smart contract.",
            "photoH": "/step4.png",
            "photoV": "/step4.png"
          },
          {
            "stage": "PROTOTYPE",
            "nombreDelPaso": "My precious...Minting process",
            "description": "Alright, our user has a wallet and it's connected to the right network, and also has some money to mint the NFT! Only left the minting process in itself, i think that every action of the user, require at least a minimal feedback, that's why i focus this last steps on what's happening and the result get us to the openSea to watch the NFT what we've made.",
            "ul": {
            },
            "descriptionTwo": "Perhaps, I had learned from some courses how to integrate the frontend with smart contracts, this was my first experience designing for a web3 integration, so grateful for me. That's all!",
          "descriptionThree": "And yep! I designed and coded the Crypto Baddies site.",
            "photoH": "/minting.gif",
            "photoV": "/minting.gif"
          }
        ]
      },
      "Allios":
      {
        "id": "Allios",
        "title": "Allios",
        "description": "Allios aims to centralize and enhance the streaming experience by combining social media features. With Allios, users can access a wide range of streaming services in one place while enjoying social interaction features such as sharing movies, creating and publishing personalized playlists, participating in watch parties, and more.",
        "problem": "The problem lies in users having to jump between different platforms without any kind of preference linkage. Additionally, the interaction with other users is minimal or even non-existent in some cases.",
        "goal": "To provide a seamless user experience that combines the convenience of accessing multiple streaming services in one place with integrated social features. Allios aims to facilitate content exploration, discovery, and sharing among users.",
        "rolDescription": "Fronted Dev, UI, UX",
        "toolsDescription": "User Research, Scope Canvas, Figma, React, TailwindCSS",
        "owner": "Bloomcker",
        "photo": "/alliosCover.png",
        "timeframe": "December 2021 - February 2022",
        "bgColor":"#7288E0",
        "open": true,
        "stages": [
          {
            "stage": "EMPATHIZE",
            "nombreDelPaso": "Uncovering User Insights and Perspectives",
            "description": "During the Empathize stage, we conducted a survey and conducted extensive user comment research to gather valuable insights. The results revealed the following findings:",
            "ul": {
              "1": "Viewing Frequency: 48% of the respondents reported that they decide to watch a series whenever they have free time, especially during weekends. This indicates that streaming content is a popular and recurring activity in their leisure routine.",
              "2": "Custom Lists: 84% of the respondents expressed a strong desire to have custom lists. This suggests that users value the ability to easily organize and access their favorite or recommended content in a custom manner",
              "3": "Influence of Friends: In 55% of the cases, respondents indicated that they follow their friends' recommendations when choosing what to watch. This highlights the importance of recommendations and social influence in users' viewing decisions.",
              "4": "Sharing Preferences: 48% of the respondents expressed a desire for others to know what they are watching, as long as they can control what information is shared. This reveals an interest in social interaction and the ability to share tastes and preferences with other users."
            },
            "descriptionTwo": "Additionally, through extensive research of user comments on various platforms, we gathered valuable information about users' frustrations, preferences, and desires. These additional data provide a deeper understanding of the specific needs and challenges to address in the design of Allios.",
            "photoH": "/alliosstats.jpg",
            "photoV": "/paintPoints.jpg"
          },
          {
            "stage": "DEFINE",
            "nombreDelPaso": " Shaping the Problem and Defining Solutions",
            "description": "In the Definition stage, the insights obtained in the previous phase, which indicated a strong demand for social interaction integration within the platform, were taken into consideration. Based on these findings, the following features were defined for Allios:",
            "ul": {
              "1": "Content Sharing and Recommendations: A feature will be integrated for users to share and recommend movies, series, or playlists to other users within the platform. This will foster social interaction and allow for the discovery of new content based on friends' and followers' recommendations.",
              "2": "Comments and Reviews: The ability to leave comments and reviews on movies, series, and other content within the platform will be enabled. Users will be able to express their opinions and share their thoughts on the content they have watched, promoting interaction and generating discussions within the community.",
              "3": "Personalized Lists: Collaborative playlist creation will be allowed, where multiple users can add and edit the content of the list. This will encourage collaboration among users and enable the discovery of new movies and series through community-curated lists.",
              "4": "Watch Parties: The option to organize and join watch parties will be included, where users can watch content in real-time with their friends or community members. This feature will create a shared viewing experience and encourage real-time interaction."
            },
            "photoH": "/defineAllios.jpg",
            "photoV": "/scopeCanvas.jpg"

          },
          {
            "stage": "PROTOTYPE",
            "nombreDelPaso": " Ideas into Interactive Experiences",
            "description": "Here, we have brought our vision to life by creating interactive prototypes that showcase key features and functionalities. During this stage, we focused on designing the home interface, notification interactions, custom list creation, and receiving friends' recommendations.",  
            "ul": {
          },
            "photoH": "/alliosprototype.jpg",
            "photoV": "/matrix.jpg"
          },
          {
            "nombreDelPaso": "Key Learnings",
            "description": "This project was such a blast to work on! I had a great time creating an entertainment survey that keeps people engaged and prevents them from getting bored. It was really important to me to design a survey that people would find enjoyable and be motivated to answer all the questions.",
            "descriptionThree": "To ensure that the final prototype was on the right track, I decided to conduct guerrilla testing with users. This involved gathering quick and informal feedback from people to see if the UI was delivering the intended experience. It was so valuable to observe how users interacted with the prototype and hear their real-time feedback. It helped me identify any areas where the design could be improved and made more user-friendly.",
            "ul": {
            },
          "photoV": "",
          "photoH": "",
          "videoV": null

          }
        ]
      },
      "Bloombot":
      {
        "id": "Bloombot",
        "title": "Bloombot",
        "shortDescription": "Web based app for coding RPA tasks for devs",
        "description": "Bloombot was a Robotic Process Automation(RPA) integrated development environment (IDE) to build automation solutions, based on python libraries.",
        "problem": "At the RPA industry, interfaces are usually based on functional blocks with defined functions. Generally, those who use these tools are developers, and this is not really the most natural way to code.",
        "goal": "Build and IDE for the RPA sector that feels like coding in python.",
        "rolDescription": "Fronted Dev, UI, UX",
        "toolsDescription": "User Research, Scope Canvas, Figma, React, TailwindCSS",
        "owner": "Bloomcker",
        "photo": "/bloombotCover.png",
        "bgColor":"#7288E0",
        "open": true,
        "stages": [
          {
            "stage": "PROTOTYPE",
            "nombreDelPaso": "Meeting the pain points",
            "description": "To better familiarize myself with the product and industry, i conducted some market research of my own. I prepared a benchmark about features of the product competitors. Also, i prepared an informal destructured interview with two usual developers of RPA software. The objective was know the pain points and the desires of the users. I ask to the team a demo of any simple task, this helped me to understand their workflow better.",
            "ul": {
            },
            "descriptionTwo": "What  i found was that the use of functional blocks involves pains like learning to use it, being restricted to the limitations of the blocks and the interfaces usually are very poor in terms of debugging.",
            "photoH": "/paintPoints.jpg",
            "photoV": "/paintPoints.jpg"
          },
          {
            "nombreDelPaso": "Aligning: concepts, users, business...",
            "description": " The idea was defined at a functional and business level, however, it was not possible to convey what the purpose was and focus on what specific problems they wanted to solve with the MVP features. To align business goals with the needs of our users, use the Scope Canvas. This tool allowed us to define how we would measure the success of the product and give a sense to what we wanted to build, simply, an RPA tool for devs designed for devs.",
            "ul": {
            },
            "photoH": "/scopeCanvas.jpg",
            "photoV": "/scopeCanvas.jpg"

          },
          {
            "nombreDelPaso": "Defining the MVP",
            "description": "The functions within the RPA tools are very varied, broad and diverse, so it was necessary to prioritize which functions would be developed for the MVP. For this point I implemented a ux session with the development team, on one side the team that was going to develop the program and in the other side, the potentials users of it.",
            "descriptionTwo": "Initially, it was explained that the objective of the activity was to determine which would be the prioritized functionalities for the MVP, so we first needed to do an exercise: in a period of 5 minutes, write on the board what they thought were the basic functions that it should have an RPA program. Subsequently, we reviewed each of the ideas, we grouped them the most similar and understood, and then we dedicated some time to explain the not so obvious. With this we come to 5 great features:",
            "ul": {
              "1": "The functions must to be builded based on full abstraction and with global scope, to allow the users to use it as Lego and communicate between them.",
              "2": "Debugger, really may to help to understand what's going on, at least which files are falling.",
              "3": "UI, as clean and functional as possible, its object is improve the coders work.",
              "4": "The RPA functions to be prioritize to develope will be relates to the web and excel activities."
          },
            "descriptionThree": "To sort this, i used a prioritization matrix, our axes was based on how many people used this vs. how much it's used",
            "photoH": "/matrix.jpg",
            "photoV": "/matrix.jpg"
          },
          {
            "nombreDelPaso": "What everybody wantend... the UI",
            "description": "With the features defined and already prioritized, the interface design process was simplified. I focused on providing the most natural experience by focusing on 4 big blocks:",
            "ul": {
              "1": "Code editor, the place where the magic happens. For a first instance, consider using line numbering and linter integration.",
              "2": "RPA tools, here the tools related to importing prebuilt functions will coexist through abstractions based on the web and excel categories.",
              "3": "Toolbar with three buttons for: code execution, launch the automation created and open the console.",
              "4": "File/Dependency Browser to view automation-related files and built-in functions(dependencies) for their operation. ",
              "5": "Console, especially needed for debugging.",
              "descriptionThree": "This project represented a big challenge to me, initially everybody was talking about the architecture, the abstractions, the functions, but nobody was talking about the product and how it will impact the users. Wear the hat of UX and also frontend dev, allows me to lead the process to build a MVP and spread the problem to solve to the devs, first than the solution."
          },
          "photoV": "/featuresIDE.png",
          "photoH": "/featuresIDE.png"

          }
        ]
      }
    }
  }
}